zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DMA_TCD_1.h
  __IO uint16_t TCD27_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x618034 */
  union {                                          /* offset: 0x618036 */
    __IO uint16_t TCD27_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x618036 */
    __IO uint16_t TCD27_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x618036 */
  } CITER27;
  __IO uint32_t TCD27_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x618038 */
  __IO uint16_t TCD27_CSR;                         /**< TCD Control and Status, offset: 0x61803C */
  union {                                          /* offset: 0x61803E */
    __IO uint16_t TCD27_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x61803E */
    __IO uint16_t TCD27_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x61803E */
  } BITER27;
  uint8_t RESERVED_55[16320];
  __IO uint32_t CH28_CSR;                          /**< Channel Control and Status, offset: 0x61C000 */
  __IO uint32_t CH28_ES;                           /**< Channel Error Status, offset: 0x61C004 */
  __IO uint32_t CH28_INT;                          /**< Channel Interrupt Status, offset: 0x61C008 */
  __IO uint32_t CH28_SBR;                          /**< Channel System Bus, offset: 0x61C00C */
  __IO uint32_t CH28_PRI;                          /**< Channel Priority, offset: 0x61C010 */
  uint8_t RESERVED_56[12];
  __IO uint32_t TCD28_SADDR;                       /**< TCD Source Address, offset: 0x61C020 */
  __IO uint16_t TCD28_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x61C024 */
  __IO uint16_t TCD28_ATTR;                        /**< TCD Transfer Attributes, offset: 0x61C026 */
  union {                                          /* offset: 0x61C028 */
    __IO uint32_t TCD28_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x61C028 */
    __IO uint32_t TCD28_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x61C028 */
  } NBYTES28;
  __IO uint32_t TCD28_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x61C02C */
  __IO uint32_t TCD28_DADDR;                       /**< TCD Destination Address, offset: 0x61C030 */
  __IO uint16_t TCD28_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x61C034 */
  union {                                          /* offset: 0x61C036 */
    __IO uint16_t TCD28_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x61C036 */
    __IO uint16_t TCD28_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x61C036 */
  } CITER28;
  __IO uint32_t TCD28_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x61C038 */
  __IO uint16_t TCD28_CSR;                         /**< TCD Control and Status, offset: 0x61C03C */
  union {                                          /* offset: 0x61C03E */
    __IO uint16_t TCD28_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x61C03E */
    __IO uint16_t TCD28_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x61C03E */
  } BITER28;
  uint8_t RESERVED_57[16320];
  __IO uint32_t CH29_CSR;                          /**< Channel Control and Status, offset: 0x620000 */
  __IO uint32_t CH29_ES;                           /**< Channel Error Status, offset: 0x620004 */
  __IO uint32_t CH29_INT;                          /**< Channel Interrupt Status, offset: 0x620008 */
  __IO uint32_t CH29_SBR;                          /**< Channel System Bus, offset: 0x62000C */
  __IO uint32_t CH29_PRI;                          /**< Channel Priority, offset: 0x620010 */
  uint8_t RESERVED_58[12];
  __IO uint32_t TCD29_SADDR;                       /**< TCD Source Address, offset: 0x620020 */
  __IO uint16_t TCD29_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x620024 */
  __IO uint16_t TCD29_ATTR;                        /**< TCD Transfer Attributes, offset: 0x620026 */
  union {                                          /* offset: 0x620028 */
    __IO uint32_t TCD29_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x620028 */
    __IO uint32_t TCD29_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x620028 */
  } NBYTES29;
  __IO uint32_t TCD29_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x62002C */
  __IO uint32_t TCD29_DADDR;                       /**< TCD Destination Address, offset: 0x620030 */
  __IO uint16_t TCD29_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x620034 */
  union {                                          /* offset: 0x620036 */
    __IO uint16_t TCD29_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x620036 */
    __IO uint16_t TCD29_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x620036 */
  } CITER29;
  __IO uint32_t TCD29_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x620038 */
  __IO uint16_t TCD29_CSR;                         /**< TCD Control and Status, offset: 0x62003C */
  union {                                          /* offset: 0x62003E */
    __IO uint16_t TCD29_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x62003E */
    __IO uint16_t TCD29_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x62003E */
  } BITER29;
  uint8_t RESERVED_59[16320];
  __IO uint32_t CH30_CSR;                          /**< Channel Control and Status, offset: 0x624000 */
  __IO uint32_t CH30_ES;                           /**< Channel Error Status, offset: 0x624004 */
  __IO uint32_t CH30_INT;                          /**< Channel Interrupt Status, offset: 0x624008 */
  __IO uint32_t CH30_SBR;                          /**< Channel System Bus, offset: 0x62400C */
  __IO uint32_t CH30_PRI;                          /**< Channel Priority, offset: 0x624010 */
  uint8_t RESERVED_60[12];
  __IO uint32_t TCD30_SADDR;                       /**< TCD Source Address, offset: 0x624020 */
  __IO uint16_t TCD30_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x624024 */
  __IO uint16_t TCD30_ATTR;                        /**< TCD Transfer Attributes, offset: 0x624026 */
  union {                                          /* offset: 0x624028 */
    __IO uint32_t TCD30_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x624028 */
    __IO uint32_t TCD30_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x624028 */
  } NBYTES30;
  __IO uint32_t TCD30_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x62402C */
  __IO uint32_t TCD30_DADDR;                       /**< TCD Destination Address, offset: 0x624030 */
  __IO uint16_t TCD30_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x624034 */
  union {                                          /* offset: 0x624036 */
    __IO uint16_t TCD30_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x624036 */
    __IO uint16_t TCD30_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x624036 */
  } CITER30;
  __IO uint32_t TCD30_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x624038 */
  __IO uint16_t TCD30_CSR;                         /**< TCD Control and Status, offset: 0x62403C */
  union {                                          /* offset: 0x62403E */
    __IO uint16_t TCD30_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x62403E */
    __IO uint16_t TCD30_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x62403E */
  } BITER30;
  uint8_t RESERVED_61[16320];
  __IO uint32_t CH31_CSR;                          /**< Channel Control and Status, offset: 0x628000 */
  __IO uint32_t CH31_ES;                           /**< Channel Error Status, offset: 0x628004 */
  __IO uint32_t CH31_INT;                          /**< Channel Interrupt Status, offset: 0x628008 */
  __IO uint32_t CH31_SBR;                          /**< Channel System Bus, offset: 0x62800C */
  __IO uint32_t CH31_PRI;                          /**< Channel Priority, offset: 0x628010 */
  uint8_t RESERVED_62[12];
  __IO uint32_t TCD31_SADDR;                       /**< TCD Source Address, offset: 0x628020 */
  __IO uint16_t TCD31_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x628024 */
  __IO uint16_t TCD31_ATTR;                        /**< TCD Transfer Attributes, offset: 0x628026 */
  union {                                          /* offset: 0x628028 */
    __IO uint32_t TCD31_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x628028 */
    __IO uint32_t TCD31_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x628028 */
  } NBYTES31;
  __IO uint32_t TCD31_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x62802C */
  __IO uint32_t TCD31_DADDR;                       /**< TCD Destination Address, offset: 0x628030 */
  __IO uint16_t TCD31_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x628034 */
  union {                                          /* offset: 0x628036 */
    __IO uint16_t TCD31_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x628036 */
    __IO uint16_t TCD31_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x628036 */
  } CITER31;
  __IO uint32_t TCD31_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x628038 */
  __IO uint16_t TCD31_CSR;                         /**< TCD Control and Status, offset: 0x62803C */
  union {                                          /* offset: 0x62803E */
    __IO uint16_t TCD31_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x62803E */
    __IO uint16_t TCD31_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x62803E */
  } BITER31;
} TCD_1_Type, *TCD_1_MemMapPtr;

/** Number of instances of the TCD_1 module. */
#define TCD_1_INSTANCE_COUNT                     (1u)

/* TCD_1 - Peripheral instance base addresses */
/** Peripheral TCD_1 base address */
#define IP_TCD_1_BASE                            (0x40014000u)
/** Peripheral TCD_1 base pointer */
#define IP_TCD_1                                 ((TCD_1_Type *)IP_TCD_1_BASE)
/** Array initializer of TCD_1 peripheral base addresses */
#define IP_TCD_1_BASE_ADDRS                      { IP_TCD_1_BASE }
/** Array initializer of TCD_1 peripheral base pointers */
#define IP_TCD_1_BASE_PTRS                       { IP_TCD_1 }

/* ----------------------------------------------------------------------------
   -- TCD_1 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TCD_1_Register_Masks TCD_1 Register Masks
 * @{
 */

/*! @name CH0_CSR - Channel Control and Status */
/*! @{ */

#define TCD_1_CH0_CSR_ERQ_MASK                   (0x1U)
#define TCD_1_CH0_CSR_ERQ_SHIFT                  (0U)
#define TCD_1_CH0_CSR_ERQ_WIDTH                  (1U)
#define TCD_1_CH0_CSR_ERQ(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_1_CH0_CSR_ERQ_SHIFT)) & TCD_1_CH0_CSR_ERQ_MASK)

#define TCD_1_CH0_CSR_EARQ_MASK                  (0x2U)
#define TCD_1_CH0_CSR_EARQ_SHIFT                 (1U)
#define TCD_1_CH0_CSR_EARQ_WIDTH                 (1U)
#define TCD_1_CH0_CSR_EARQ(x)                    (((uint32_t)(((uint32_t)(x)) << TCD_1_CH0_CSR_EARQ_SHIFT)) & TCD_1_CH0_CSR_EARQ_MASK)

#define TCD_1_CH0_CSR_EEI_MASK                   (0x4U)
#define TCD_1_CH0_CSR_EEI_SHIFT                  (2U)
#define TCD_1_CH0_CSR_EEI_WIDTH                  (1U)
#define TCD_1_CH0_CSR_EEI(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_1_CH0_CSR_EEI_SHIFT)) & TCD_1_CH0_CSR_EEI_MASK)

#define TCD_1_CH0_CSR_EBW_MASK                   (0x8U)
#define TCD_1_CH0_CSR_EBW_SHIFT                  (3U)
#define TCD_1_CH0_CSR_EBW_WIDTH                  (1U)
#define TCD_1_CH0_CSR_EBW(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_1_CH0_CSR_EBW_SHIFT)) & TCD_1_CH0_CSR_EBW_MASK)

#define TCD_1_CH0_CSR_DONE_MASK                  (0x40000000U)
#define TCD_1_CH0_CSR_DONE_SHIFT                 (30U)
#define TCD_1_CH0_CSR_DONE_WIDTH                 (1U)
#define TCD_1_CH0_CSR_DONE(x)                    (((uint32_t)(((uint32_t)(x)) << TCD_1_CH0_CSR_DONE_SHIFT)) & TCD_1_CH0_CSR_DONE_MASK)

#define TCD_1_CH0_CSR_ACTIVE_MASK                (0x80000000U)
#define TCD_1_CH0_CSR_ACTIVE_SHIFT               (31U)
#define TCD_1_CH0_CSR_ACTIVE_WIDTH               (1U)
#define TCD_1_CH0_CSR_ACTIVE(x)                  (((uint32_t)(((uint32_t)(x)) << TCD_1_CH0_CSR_ACTIVE_SHIFT)) & TCD_1_CH0_CSR_ACTIVE_MASK)
/*! @} */

/*! @name CH0_ES - Channel Error Status */
/*! @{ */

#define TCD_1_CH0_ES_DBE_MASK                    (0x1U)
#define TCD_1_CH0_ES_DBE_SHIFT                   (0U)
#define TCD_1_CH0_ES_DBE_WIDTH                   (1U)
#define TCD_1_CH0_ES_DBE(x)                      (((uint32_t)(((uint32_t)(x)) << TCD_1_CH0_ES_DBE_SHIFT)) & TCD_1_CH0_ES_DBE_MASK)

#define TCD_1_CH0_ES_SBE_MASK                    (0x2U)
#define TCD_1_CH0_ES_SBE_SHIFT                   (1U)
#define TCD_1_CH0_ES_SBE_WIDTH                   (1U)
#define TCD_1_CH0_ES_SBE(x)                      (((uint32_t)(((uint32_t)(x)) << TCD_1_CH0_ES_SBE_SHIFT)) & TCD_1_CH0_ES_SBE_MASK)

#define TCD_1_CH0_ES_SGE_MASK                    (0x4U)
#define TCD_1_CH0_ES_SGE_SHIFT                   (2U)
#define TCD_1_CH0_ES_SGE_WIDTH                   (1U)
#define TCD_1_CH0_ES_SGE(x)                      (((uint32_t)(((uint32_t)(x)) << TCD_1_CH0_ES_SGE_SHIFT)) & TCD_1_CH0_ES_SGE_MASK)

#define TCD_1_CH0_ES_NCE_MASK                    (0x8U)
#define TCD_1_CH0_ES_NCE_SHIFT                   (3U)
#define TCD_1_CH0_ES_NCE_WIDTH                   (1U)
#define TCD_1_CH0_ES_NCE(x)                      (((uint32_t)(((uint32_t)(x)) << TCD_1_CH0_ES_NCE_SHIFT)) & TCD_1_CH0_ES_NCE_MASK)

#define TCD_1_CH0_ES_DOE_MASK                    (0x10U)
#define TCD_1_CH0_ES_DOE_SHIFT                   (4U)
#define TCD_1_CH0_ES_DOE_WIDTH                   (1U)
#define TCD_1_CH0_ES_DOE(x)                      (((uint32_t)(((uint32_t)(x)) << TCD_1_CH0_ES_DOE_SHIFT)) & TCD_1_CH0_ES_DOE_MASK)

#define TCD_1_CH0_ES_DAE_MASK                    (0x20U)
#define TCD_1_CH0_ES_DAE_SHIFT                   (5U)
#define TCD_1_CH0_ES_DAE_WIDTH                   (1U)
#define TCD_1_CH0_ES_DAE(x)                      (((uint32_t)(((uint32_t)(x)) << TCD_1_CH0_ES_DAE_SHIFT)) & TCD_1_CH0_ES_DAE_MASK)

