zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DMA_TCD_1.h
#define TCD_1_TCD5_DADDR_DADDR_MASK              (0xFFFFFFFFU)
#define TCD_1_TCD5_DADDR_DADDR_SHIFT             (0U)
#define TCD_1_TCD5_DADDR_DADDR_WIDTH             (32U)
#define TCD_1_TCD5_DADDR_DADDR(x)                (((uint32_t)(((uint32_t)(x)) << TCD_1_TCD5_DADDR_DADDR_SHIFT)) & TCD_1_TCD5_DADDR_DADDR_MASK)
/*! @} */

/*! @name TCD5_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define TCD_1_TCD5_DOFF_DOFF_MASK                (0xFFFFU)
#define TCD_1_TCD5_DOFF_DOFF_SHIFT               (0U)
#define TCD_1_TCD5_DOFF_DOFF_WIDTH               (16U)
#define TCD_1_TCD5_DOFF_DOFF(x)                  (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_DOFF_DOFF_SHIFT)) & TCD_1_TCD5_DOFF_DOFF_MASK)
/*! @} */

/*! @name TCD5_CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define TCD_1_TCD5_CITER_ELINKNO_CITER_MASK      (0x7FFFU)
#define TCD_1_TCD5_CITER_ELINKNO_CITER_SHIFT     (0U)
#define TCD_1_TCD5_CITER_ELINKNO_CITER_WIDTH     (15U)
#define TCD_1_TCD5_CITER_ELINKNO_CITER(x)        (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_CITER_ELINKNO_CITER_SHIFT)) & TCD_1_TCD5_CITER_ELINKNO_CITER_MASK)

#define TCD_1_TCD5_CITER_ELINKNO_ELINK_MASK      (0x8000U)
#define TCD_1_TCD5_CITER_ELINKNO_ELINK_SHIFT     (15U)
#define TCD_1_TCD5_CITER_ELINKNO_ELINK_WIDTH     (1U)
#define TCD_1_TCD5_CITER_ELINKNO_ELINK(x)        (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_CITER_ELINKNO_ELINK_SHIFT)) & TCD_1_TCD5_CITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD5_CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define TCD_1_TCD5_CITER_ELINKYES_CITER_MASK     (0x1FFU)
#define TCD_1_TCD5_CITER_ELINKYES_CITER_SHIFT    (0U)
#define TCD_1_TCD5_CITER_ELINKYES_CITER_WIDTH    (9U)
#define TCD_1_TCD5_CITER_ELINKYES_CITER(x)       (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_CITER_ELINKYES_CITER_SHIFT)) & TCD_1_TCD5_CITER_ELINKYES_CITER_MASK)

#define TCD_1_TCD5_CITER_ELINKYES_LINKCH_MASK    (0x3E00U)
#define TCD_1_TCD5_CITER_ELINKYES_LINKCH_SHIFT   (9U)
#define TCD_1_TCD5_CITER_ELINKYES_LINKCH_WIDTH   (5U)
#define TCD_1_TCD5_CITER_ELINKYES_LINKCH(x)      (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_CITER_ELINKYES_LINKCH_SHIFT)) & TCD_1_TCD5_CITER_ELINKYES_LINKCH_MASK)

#define TCD_1_TCD5_CITER_ELINKYES_ELINK_MASK     (0x8000U)
#define TCD_1_TCD5_CITER_ELINKYES_ELINK_SHIFT    (15U)
#define TCD_1_TCD5_CITER_ELINKYES_ELINK_WIDTH    (1U)
#define TCD_1_TCD5_CITER_ELINKYES_ELINK(x)       (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_CITER_ELINKYES_ELINK_SHIFT)) & TCD_1_TCD5_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name TCD5_DLAST_SGA - TCD Last Destination Address Adjustment / Scatter Gather Address */
/*! @{ */

#define TCD_1_TCD5_DLAST_SGA_DLAST_SGA_MASK      (0xFFFFFFFFU)
#define TCD_1_TCD5_DLAST_SGA_DLAST_SGA_SHIFT     (0U)
#define TCD_1_TCD5_DLAST_SGA_DLAST_SGA_WIDTH     (32U)
#define TCD_1_TCD5_DLAST_SGA_DLAST_SGA(x)        (((uint32_t)(((uint32_t)(x)) << TCD_1_TCD5_DLAST_SGA_DLAST_SGA_SHIFT)) & TCD_1_TCD5_DLAST_SGA_DLAST_SGA_MASK)
/*! @} */

/*! @name TCD5_CSR - TCD Control and Status */
/*! @{ */

#define TCD_1_TCD5_CSR_START_MASK                (0x1U)
#define TCD_1_TCD5_CSR_START_SHIFT               (0U)
#define TCD_1_TCD5_CSR_START_WIDTH               (1U)
#define TCD_1_TCD5_CSR_START(x)                  (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_CSR_START_SHIFT)) & TCD_1_TCD5_CSR_START_MASK)

#define TCD_1_TCD5_CSR_INTMAJOR_MASK             (0x2U)
#define TCD_1_TCD5_CSR_INTMAJOR_SHIFT            (1U)
#define TCD_1_TCD5_CSR_INTMAJOR_WIDTH            (1U)
#define TCD_1_TCD5_CSR_INTMAJOR(x)               (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_CSR_INTMAJOR_SHIFT)) & TCD_1_TCD5_CSR_INTMAJOR_MASK)

#define TCD_1_TCD5_CSR_INTHALF_MASK              (0x4U)
#define TCD_1_TCD5_CSR_INTHALF_SHIFT             (2U)
#define TCD_1_TCD5_CSR_INTHALF_WIDTH             (1U)
#define TCD_1_TCD5_CSR_INTHALF(x)                (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_CSR_INTHALF_SHIFT)) & TCD_1_TCD5_CSR_INTHALF_MASK)

#define TCD_1_TCD5_CSR_DREQ_MASK                 (0x8U)
#define TCD_1_TCD5_CSR_DREQ_SHIFT                (3U)
#define TCD_1_TCD5_CSR_DREQ_WIDTH                (1U)
#define TCD_1_TCD5_CSR_DREQ(x)                   (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_CSR_DREQ_SHIFT)) & TCD_1_TCD5_CSR_DREQ_MASK)

#define TCD_1_TCD5_CSR_ESG_MASK                  (0x10U)
#define TCD_1_TCD5_CSR_ESG_SHIFT                 (4U)
#define TCD_1_TCD5_CSR_ESG_WIDTH                 (1U)
#define TCD_1_TCD5_CSR_ESG(x)                    (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_CSR_ESG_SHIFT)) & TCD_1_TCD5_CSR_ESG_MASK)

#define TCD_1_TCD5_CSR_MAJORELINK_MASK           (0x20U)
#define TCD_1_TCD5_CSR_MAJORELINK_SHIFT          (5U)
#define TCD_1_TCD5_CSR_MAJORELINK_WIDTH          (1U)
#define TCD_1_TCD5_CSR_MAJORELINK(x)             (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_CSR_MAJORELINK_SHIFT)) & TCD_1_TCD5_CSR_MAJORELINK_MASK)

#define TCD_1_TCD5_CSR_ESDA_MASK                 (0x80U)
#define TCD_1_TCD5_CSR_ESDA_SHIFT                (7U)
#define TCD_1_TCD5_CSR_ESDA_WIDTH                (1U)
#define TCD_1_TCD5_CSR_ESDA(x)                   (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_CSR_ESDA_SHIFT)) & TCD_1_TCD5_CSR_ESDA_MASK)

#define TCD_1_TCD5_CSR_MAJORLINKCH_MASK          (0x1F00U)
#define TCD_1_TCD5_CSR_MAJORLINKCH_SHIFT         (8U)
#define TCD_1_TCD5_CSR_MAJORLINKCH_WIDTH         (5U)
#define TCD_1_TCD5_CSR_MAJORLINKCH(x)            (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_CSR_MAJORLINKCH_SHIFT)) & TCD_1_TCD5_CSR_MAJORLINKCH_MASK)

#define TCD_1_TCD5_CSR_BWC_MASK                  (0xC000U)
#define TCD_1_TCD5_CSR_BWC_SHIFT                 (14U)
#define TCD_1_TCD5_CSR_BWC_WIDTH                 (2U)
#define TCD_1_TCD5_CSR_BWC(x)                    (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_CSR_BWC_SHIFT)) & TCD_1_TCD5_CSR_BWC_MASK)
/*! @} */

/*! @name TCD5_BITER_ELINKNO - TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define TCD_1_TCD5_BITER_ELINKNO_BITER_MASK      (0x7FFFU)
#define TCD_1_TCD5_BITER_ELINKNO_BITER_SHIFT     (0U)
#define TCD_1_TCD5_BITER_ELINKNO_BITER_WIDTH     (15U)
#define TCD_1_TCD5_BITER_ELINKNO_BITER(x)        (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_BITER_ELINKNO_BITER_SHIFT)) & TCD_1_TCD5_BITER_ELINKNO_BITER_MASK)

#define TCD_1_TCD5_BITER_ELINKNO_ELINK_MASK      (0x8000U)
#define TCD_1_TCD5_BITER_ELINKNO_ELINK_SHIFT     (15U)
#define TCD_1_TCD5_BITER_ELINKNO_ELINK_WIDTH     (1U)
#define TCD_1_TCD5_BITER_ELINKNO_ELINK(x)        (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_BITER_ELINKNO_ELINK_SHIFT)) & TCD_1_TCD5_BITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD5_BITER_ELINKYES - TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define TCD_1_TCD5_BITER_ELINKYES_BITER_MASK     (0x1FFU)
#define TCD_1_TCD5_BITER_ELINKYES_BITER_SHIFT    (0U)
#define TCD_1_TCD5_BITER_ELINKYES_BITER_WIDTH    (9U)
#define TCD_1_TCD5_BITER_ELINKYES_BITER(x)       (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_BITER_ELINKYES_BITER_SHIFT)) & TCD_1_TCD5_BITER_ELINKYES_BITER_MASK)

#define TCD_1_TCD5_BITER_ELINKYES_LINKCH_MASK    (0x3E00U)
#define TCD_1_TCD5_BITER_ELINKYES_LINKCH_SHIFT   (9U)
#define TCD_1_TCD5_BITER_ELINKYES_LINKCH_WIDTH   (5U)
#define TCD_1_TCD5_BITER_ELINKYES_LINKCH(x)      (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_BITER_ELINKYES_LINKCH_SHIFT)) & TCD_1_TCD5_BITER_ELINKYES_LINKCH_MASK)

#define TCD_1_TCD5_BITER_ELINKYES_ELINK_MASK     (0x8000U)
#define TCD_1_TCD5_BITER_ELINKYES_ELINK_SHIFT    (15U)
#define TCD_1_TCD5_BITER_ELINKYES_ELINK_WIDTH    (1U)
#define TCD_1_TCD5_BITER_ELINKYES_ELINK(x)       (((uint16_t)(((uint16_t)(x)) << TCD_1_TCD5_BITER_ELINKYES_ELINK_SHIFT)) & TCD_1_TCD5_BITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name CH6_CSR - Channel Control and Status */
/*! @{ */

#define TCD_1_CH6_CSR_ERQ_MASK                   (0x1U)
#define TCD_1_CH6_CSR_ERQ_SHIFT                  (0U)
#define TCD_1_CH6_CSR_ERQ_WIDTH                  (1U)
#define TCD_1_CH6_CSR_ERQ(x)                     (((uint32_t)(((uint32_t)(x)) << TCD_1_CH6_CSR_ERQ_SHIFT)) & TCD_1_CH6_CSR_ERQ_MASK)

